<script>
  import Card from "$lib/shared/ui/Card.svelte";
  import H2 from "$lib/shared/ui/H2.svelte";
  import CodeBlock from "$lib/shared/ui/CodeBlock.svelte";
  import A from "$lib/shared/ui/A.svelte";
  import Ul from "$lib/shared/ui/Ul.svelte";
  import Code from "$lib/shared/Code.svelte";
  import Callout from "$lib/entities/article/ui/Callout.svelte";
  import H3 from "$lib/shared/ui/H3.svelte";
</script>

<Card>
  <H2>Дисклеймер</H2>
  <Ul>
    <li>Все, что написано ниже, можно применять к любому бекенду, не только на Python</li>
    <li>Все, что написано ниже, необязательно соблюдать строго, <b>главное чтобы с кодом было удобно работать</b></li>
  </Ul>
</Card>


<Card>
  <H2>Структура папочек</H2>

  <CodeBlock>{`src/
├─ core/
│  ├─ str_utils.py
│  ├─ sql_repo.py
│  ├─ api_client.py
├─ entities/
│  ├─ order/
│  │  ├─ order.py
├─ features/
│  ├─ order/
│  │  ├─ create_order/
│  │  │  ├─ create_order.py
│  │  ├─ ports/
│  │  │  ├─ order_repo.py
├─ infra/
│  ├─ order/
│  │  ├─ sql_order_repo.py
│  ├─ ext_api/
│  │  ├─ ext_api_client.py
│  │  ├─ ext_api_repo.py
├─ views/
│  ├─ order/
│  │  ├─ api.py
│  │  ├─ admin.py
├─ root/
│  ├─ server.py
│  ├─ ioc.py
main.py
`}</CodeBlock>

  <Ul>
    <li>Делаем в стиле DDD / Clean Architecture / Hexagonal</li>

    <li><Code>core</Code> / <Code>shared</Code> — всякий переиспользуемый код: утилитки, базовые
      классы для работы с бд, http-запросами
    </li>
    <li><Code>entities</Code> / <Code>models</Code> / <Code>domain</Code> — доменные сущности и логика внутри них - все
      с чем работает бизнес: заказы, клиенты, точки
    </li>
    <li><Code>features</Code> / <Code>use_cases</Code> / <Code>services</Code> — юзкейсы, сервисы, бизнес-логика - все
      что приносит ценность бизнесу:
      создание заказа, регистрация клиента
      <Ul nested={true}>
        <li><Code>ports</Code> — в юзкейсе, обычно, надо ходить в бд, делать запросы к другим сервисам, но это должно
          быть
          абстрактно, на этом слое мы не должны зависеть от конкретных технологий, типа SQL, Google API - так что тут
          делаем интерфейсы (абстрактные классы) для работы с бд, сторонними сервисами
        </li>
      </Ul>

    </li>
    <li><Code>infra</Code> — здесь реализуем те самые интерфейсы из <Code>ports</Code>: классы, которые отправляют
      sql-запросы, http-запросы
    </li>
    <li><Code>views</Code> / <Code>handlers</Code> / <Code>endpoints</Code> / <Code>api</Code> — апи-ендпоинты: парсят данные из
      http-запросов, дергают бизнес логику и сериализуют результат
    </li>
    <li><Code>roott</Code> / <Code>config</Code> / <Code>composition_root</Code> — здесь все склеивается вместе: регистрация роутов, создание
      классов-сервисов с конкретными зависимостями (ака IoC-Container)
    </li>
  </Ul>

  <Callout type="warn">
    Каждый слой может использовать код только из своего слоя или слоев ниже, но не слоев выше
    <div slot="desc">
      Так <Code>features</Code> может использовать код из <Code>shared</Code>, <Code>entities</Code>,
      <Code>features</Code>,
      но не может использовать код из <Code>infra</Code>
    </div>
  </Callout>

  <H3>Что дает такая структура</H3>
  <Ul>
    <li><b>Устранение циклических зависимостей</b> — циклические зависимости возникают если нижний слой использует верхний слой, а у нас это запрещено  </li>
    <li><b>Тестируемость</b> — так как все разделено, можно легко мокать зависимости </li>
  </Ul>

  <Ul>


  </Ul>


</Card>

<Card>
  <H2>Код-стайл</H2>

  <H3>Именование</H3>

  <Ul>
    <li>🐍 <Code>snake_case</Code> — для пакетов, модулей, методов, переменных; <Code>PascalCase</Code> — для классов
    </li>
    <li>Именовать что бы то ни было стоит максимально подробно, <b>архитектура должна быть кричащей</b> - чтобы сразу по
      названию можно было сказать что код делает
    </li>
  </Ul>

  <H3>Тесты</H3>

  <Ul>
    <li><b>Зачем нужны?</b> Чтобы быть уверенным в своем коде</li>
  </Ul>




</Card>

<Card>
  <H2>Автоматизируем</H2>

  <Ul>
    <li><A href="https://black.readthedocs.io/en/stable/">Black</A> — форматирует все красиво</li>
    <li><A href="https://beta.ruff.rs/docs/">Ruff</A> — супер быстрый линтер</li>
  </Ul>
</Card>

<Card>
  <H2>Почитать/посмотреть на тему</H2>

  <Ul>
    <li>📝 <A href="https://medium.com/codex/clean-architecture-for-dummies-df6561d42c94">A Beginner’s Guide to Domain-centric Architectures (clean, hexagonal, …)</A> — супер статья про слоистую архитектуру
    </li>
    <li>
      📹 <A href="https://youtu.be/45rk0iyTn7I">Борис Цема, Wargaming.net «Как мы уменьшили сложность наших проектов»</A> —
      видос про слоистую архитектуру
    </li>
    <li>📖 Весь <A href="https://ru.wikipedia.org/wiki/Мартин,_Роберт_(инженер)">Роберт Мартин</A></li>
    <li>📖 Весь <A href="https://ru.wikipedia.org/wiki/Фаулер,_Мартин">Мартин Фаулер</A> <s>(развелось Мартинов)</s>
    <li>📖 Весь <A href="https://ru.wikipedia.org/wiki/Макконнелл,_Стив">Стив Макконнелл</A></li>
    <li>📖 Троица про DDD:
      <A href="https://www.amazon.com/dp/0321125215/">Domain-Driven Design</A>,
      <A href="https://www.amazon.com/dp/0321834577/">Implementing Domain-Driven Design</A>,
      <A href="https://www.amazon.com/dp/0134434420/">Distilled Domain-Driven Design</A>
    </li>

  </Ul>

</Card>