<script lang="ts">
	import A from '$lib/design-system/atoms/A.svelte';
	import H2 from '$lib/design-system/atoms/H2.svelte';
	import H3 from '$lib/design-system/atoms/H3.svelte';
	import Li from '$lib/design-system/atoms/Li.svelte';
	import P from '$lib/design-system/atoms/P.svelte';
	import Ul from '$lib/design-system/atoms/Ul.svelte';
	import ArticleHeader from '$lib/design-system/molecules/ArticleHeader.svelte';
	import Callout from '$lib/design-system/molecules/Callout.svelte';
	import YandexList from '$lib/design-system/molecules/YandexList.svelte';
	import Card from './Card.svelte';
</script>

<div class="space-y-3 md:space-y-5 !mt-0">
	<Card>
		<P><i>Все места на Яндекс Картах:</i></P>
		<YandexList
			amount={23}
			link="https://yandex.ru/maps?bookmarks%5BpublicId%5D=Y_xX3qTb&utm_source=share&utm_campaign=bookmarks"
		>
			Екат Проверенный
		</YandexList>
	</Card>

	<Card>
		<H2>Как добраться, где жить</H2>
		<Ul noListItems={true}>
			<Li class="font-semibold" icon="✈️">SVO ➡️ SVX ~ 2 ч.</Li>
			<Li class="font-semibold" icon="🚕">Аэропорт ➡️ Пл. 1905 года ~ 30 мин.</Li>
			<Li class="font-semibold" icon="🏨"
				><A href="https://radiusrentapart.turbo.site/">Радиус Централ Хаус</A></Li
			>
		</Ul>
	</Card>

	<Card>
		<H2>План</H2>
		<P><i>Как было у нас</i></P>
		<H3>День 1</H3>
		<Ul noListItems={true}>
			<Li icon="🍴"><A href="https://dvadeda.ru/">Два Деда</A> — уральские пельмени и чебуреки</Li>
			<Li icon="🏢">
				<A href="https://yeltsin.ru/">Ельцин Центр</A> — тут движуха всякая: магазики, музеи, галереи,
				спорт
			</Li>
			<Li icon="🍴">
				<A href="https://barboris.info/">Барборис</A> — солидный рестик, тоже уральская кухня: грибочки
				грузди, козленок
			</Li>
		</Ul>
		<hr class="my-2" />
		<H3>День 2</H3>
		<Ul noListItems={true}>
			<Li icon="🍴">
				<A href="https://engelscoffee.ru/">Engels</A> — норм завтраки: континентальным завтраком обжираешься
			</Li>
			<Li icon="🚶🏼">
				<A href="https://www.ekbredline.ru/">Красная линия Екатеринбурга</A> — мастхев чтобы узнать город:
				красная линия, проходящая по центру города, которая освещает основные достопримечательности
			</Li>
			<Li icon="🍴">
				<A href="https://yandex.ru/maps/-/CCU9RIWJkA">Мангалыч</A> — Бомбическая Шаурма — так и называется:
				размером с локоть, нереально вкусная — но желающих так много, что
				<b>придется подождать минут 40</b>
			</Li>
			<Li icon="🚶🏼">
				<A href="https://yandex.ru/maps/-/CCU9RIXScA">УралМаш</A> — ехать туда стоит только если хочешь
				шаурмы, а так <b>не надо</b>, там тебе не будут рады: так мы, выйдя из метро, первое что мы
				увидели - это девочка в футболке "Иди нахуй"; а потом были орки, много орков: просто в 2
				часа дня уже убитые-упитые ходят-плетутся
			</Li>
			<Li icon="🍴">
				<A href="https://nigora.ru/">Нигора</A> — чайхона, но балдежная: стройное меню, низкие цены,
				нормальные порции и все вкусное: лагман, плов, манты, морковочка, чайок
			</Li>
		</Ul>

		<Callout>
			Местная особенность
			<div slot="desc">
				В Екате далеко не везде принято бронировать — так что будь готов размещаться по факту
			</div>
		</Callout>

		<H3>День 3</H3>
		<Ul>
			<Li icon="🍴"
				><A href="https://gorozhane.me/">Горожане</A> — оч кайфовые завтраки и десерты</Li
			>
		</Ul>

		<hr class="my-2" />

		<H3>День 4</H3>
		<Ul>
			<Li icon="🍴"
				><A href="https://gorozhane.me/">Горожане</A> — такие кайфовые, что еще раз можно сходить</Li
			>
		</Ul>
	</Card>
</div>
