<script>
	import H1 from '$lib/shared/ui/H1.svelte';
</script>

<H1>Как делать свои проекты</H1>

## Прототипами - 💡Фраза "я сегодня потренировался, и стал стройнее" звучит гораздо лучше чем "мне
нужно заниматься спортом несколько лет чтобы похудеть" 💡Аналогично "я сделал простую кулинарную
книгу, и теперь мне есть куда записывать рецепты" звучит лучше чем "мне нужно 2 года чтобы сделать
кулинарную книгу " Мем про аналогию 💡 Первый майндсет настраивает на разработку действующего
прототипа, а не бесконечного дизайна/кодинга/рефакторинга 💡 Соответственно, **задачи можно делать
не много времени и до победного, а маленькими прототипами** 💡Так, я написал эту статью, в виде
маленького рабочего прототипа (в виде одной мысли), вместо "надо закинуть куда-то мысли и потом
что-нибудь из этого сделать" *Done is better than perfect* - как грится
