<script>
	import Callout from '$lib/entities/article/ui/Callout.svelte';
	import ImgBlock from '$lib/entities/article/ui/ImgBlock.svelte';
	import ImgSide from '$lib/entities/article/ui/ImgSide.svelte';
	import A from '$lib/shared/ui/A.svelte';
	import Card from '$lib/shared/ui/Card.svelte';
	import H1 from '$lib/shared/ui/H1.svelte';
	import H2 from '$lib/shared/ui/H2.svelte';
	import H3 from '$lib/shared/ui/H3.svelte';
	import Hr from '$lib/shared/ui/Hr.svelte';
	import Ul from '$lib/shared/ui/Ul.svelte';
	import BlockWithImg from '../travel/ekat/BlockWithImg.svelte';
	import Analogy from './assets/analogy.jpeg';
	import Proto from './assets/proto.jpg';
</script>

<Card>
	<H2>Прототипами</H2>

	<BlockWithImg>
		<Ul>
			<li>
				💡Фраза <i>"я сегодня потренировался, и стал стройнее"</i> звучит гораздо лучше чем
				<i>"мне нужно заниматься спортом несколько лет чтобы похудеть"</i>
			</li>
			<li>
				💡Аналогично <i
					>"я сделал <A href="http://skovoroda.website.yandexcloud.net/">простую кулинарную книгу</A
					>, и теперь мне есть куда записывать рецепты"</i
				>
				звучит лучше чем <i>"мне нужно 2 года чтобы сделать кулинарную книгу"</i>
			</li>
		</Ul>

		<ImgSide src={Analogy} />
	</BlockWithImg>

	<Ul>
		<li>
			💡 Первый майндсет настраивает на разработку действующего прототипа, а не бесконечного
			дизайна/кодинга/рефакторинга
		</li>
		<li>
			💡 Соответственно, <b
				>задачи можно делать не много времени и до победного, а маленькими прототипами</b
			>
		</li>
		<li>
			💡Так, я написал эту статью, в виде маленького рабочего прототипа (в виде одной мысли), вместо
			"надо закинуть куда-то мысли и потом что-нибудь из этого сделать"
		</li>
	</Ul>

	<Callout><i>Done is better than perfect</i> - как грится</Callout>
</Card>

<Card>
	<H2>Как делать прототипы</H2>

	<Ul>
		<li>
			Если хочется сделать приложение для решения проблемы, для начала стоит <b
				>погуглить готовые решенияпогуглить готовые решения</b
			>
		</li>
		<li>
			Иначе, вместо решения изначальной проблемы, ты будешь занят решением другой проблемы -
			написанием приложения
		</li>
		<li>
			Если все говно, то пробуем сделать свой продукт на базе <b>экселяэкселя</b> или <A
				href="https://notion.so">Notion</A
			> / <A href="https://www.airtable.com">Airtable</A>
			/другой nocode
		</li>
		<li>Если и ноукод бессилен, то начинаем делать <b>MVP</b></li>
	</Ul>

	<ImgBlock src={Proto} />
</Card>

<Card>
	<H2>На чем делать MVP?</H2>

	<Ul>
		<li>На чем ты умеешь</li>
		<li>На чем-то максимально простом</li>
	</Ul>

	<H2>Простой фронтенд</H2>

	<Ul>
		<li>
			<b>Telegram Бот</b> - хороший фронтенд, если достаточно текста
			<Ul nested={true}>
				<li>
					<i
						>Хотя там уже столько всего накрутили, что туда можно <A
							href="https://core.telegram.org/bots/webapps">полноценные веб приложения деплоить</A
						></i
					>
				</li>
			</Ul>
		</li>
		<li>
			<b>HTML-файл</b> - все можно сделать в рамках одного файла, без всяких npm-пакетов, сборщиков,
			фреймворков (почти)
		</li>
	</Ul>

	<Callout type="warn">СДЕЛАЙ ТЫ УЖЕ ХОТЬ ЧТО-НИБУДЬ</Callout>

	<H3>А как?</H3>

	<Ul>
		<li>
			<b>А как динамику добавить?</b> Есть <A href="https://github.com/vuejs/petite-vue"
				>petite Vue</A
			> - урезанный 6 Кб Vue, который ставится по ссылке
		</li>

		<li>
			**А как дезигн сделать?** Юзай лайтовые CSS фреймворки:
			<Ul nested={true}>
				<li>
					<A href="https://bulma.io/">bulma</A> - лайтовый css-фреймворк как есть - просто импортишь
					css-файл, и дальше используешь классы/компоненты
				</li>
				<li>
					<A href="https://yegor256.github.io/tacit/">tacit</A>, [pico](https://picocss.com/) - еще
					проще - импортишь либу и вообще не надо писать классы, все уже и так выглядит норм
				</li>
				<li>
					<A href="https://tailwindcss.com/">tailwind</A> - если хочется кастомный диз, но писать css-код
					не хочется - этот фреймворк предоставляет утилитки на все случаи жизни
				</li>
				<li>
					<A href="https://github.com/troxler/awesome-css-frameworks">Больше css-фреймворков</A>
				</li>
			</Ul>
		</li>
		<li>
			<b>А как хоститься?</b>
			<A href="https://pages.github.com/">Github Pages</A> или закинуть статикуна <A
				href="https://cloud.yandex.ru/services/storage">Yandex Object Storage</A
			>
		</li>
	</Ul>

	<H2>А как бекенд сделать?</H2>

	<Ul>
		<li>
			Юзать <b>BAAS</b>: <A href="https://firebase.google.com/">фаербейз</A> и <A
				href="https://www.youtube.com/watch?v=SXmYUalHyYk">другие</A
			> в частности <A href="https://supabase.com/">supabase</A>
		</li>
		<li>
			Использовать <b>serverless</b> функции - напр. <A
				href="https://cloud.yandex.ru/services/functions">Cloud Functions</A
			> от Яндекс облака
			<Ul>
				<li>Писать код бека можно прямо в интерфейсе</li>
			</Ul>
		</li>
	</Ul>

	<H3>А че по базам?</H3>

	<Ul>
		<li>Опять же: можно использовать Notion API и API Гугл Таблиц</li>
		<li>
			Яндекс предоставляет <A href="https://cloud.yandex.ru/services/ydb">ydb</A> - бд на serverless
			с Amazon Dynamo DB совместимостью

			<Ul nested={true}>
				<li>Стоит - ничего при петпроджект нагрузке</li>
			</Ul>
		</li>

		<li>Вот <A href="https://free-for.dev/">огромный список сервисов с фри-тирами</A></li>
	</Ul>
</Card>

<Card>
	<H2>Когда переходить к вещам посерьёзнее?</H2>

	<Ul>
		<li>Когда мвп работает (приносит ценность)</li>
		<li>Когда один файл поддерживать сложно</li>
	</Ul>

	<Hr />

	И помни...

	<Callout type="warn">НИКАКИХ КУБЕРОВ</Callout>
</Card>
